app/Http/Controllers/FacultyController.php

select * from `faculties` order by `id` desc limit 10 offset 0
select count(*) as aggregate from `faculties`
---
    public function index()
    {
        $faculties = Faculty::orderBy('id','desc')->paginate(10);