app/Http/Controllers/PersonController.php

    public function index()
    {
        \request()->flash();
        $search = \request('search');
        $subject_count = Subject::all()->count();
        $students = $this->personRepository->search(request()->all(), $subject_count);
        $fas = $students->load('faculty')->all();
        $faculties = Faculty::all();
---
select * from `subjects`
select * from `faculties`

    public function show($slug)
    {
        $subjects = $this->subjectRepository->getAllList();
        $faculties = Faculty::all(['name', 'id']);
        $person = Person::where('slug', $slug)->firstOrFail();
---
select `name`, `id` from `faculties`
select * from `persons` where `slug` = 'quos-magnam-nulla-amet-perspiciatis-est-ad-voluptas-fugiat' limit 1

    public function getEditPerson($id){
        $faculties = $this->facultyRepository->getAllList();
        $subjects = $this->subjectRepository->getAllList();
        $person = $this->personRepository->getListById($id)->load('user');
---
select * from `users` where `users`.`id` in (38)

    public function createOrUpdate(PointRequest $request, $id)
    {
        $data_object = collect($request);
        if(count($data_object) == 2){
            return redirect()->back()->with('error','No subjects');
        }else{
            $x = 0;
            $subject_id = collect($request['subject_id']);
            $point = collect($request['point']);
            if (auth()->user()->admin == 0) {
                foreach ($point as $key => $item) {
                    $result[]['point'] = 0;
                }
            } else {
                foreach ($point as $key => $item) {
                    $result[] = $item;
                }
            }
            $data = array_slice($result, $x);
            if (count($subject_id) == count($data)) {
                foreach ($subject_id as $key => $value) {
                    $combined[$value] = $data[$x];
                    $x++;
                }
            }
            $person = Person::find($id)->load('subjects');
---
select `subjects`.*, `points`.`person_id` as `pivot_person_id`, `points`.`subject_id` as `pivot_subject_id`, `points`.`point` as `pivot_point` from `subjects` inner join `points` on `subjects`.`id` = `points`.`subject_id` where `points`.`person_id` in (2)