app/Http/Controllers/UserController.php

select * from `users` order by `updated_at` desc limit 10 offset 10
select count(*) as aggregate from `users`
---
    public function index()
    {
        $users = User::orderBy('updated_at', 'desc')->paginate(10);

delete from `model_has_roles` where `model_id` = '38'
---
    public function update(RequestUser $request, $id)
    {
        $data = $request->all();
        $this->userRepository->update($id, $data);
        $user = $this->userRepository->getListById($id);
        DB::table('model_has_roles')->where('model_id', $id)->delete();

select * from `users` where `id` = '48'
delete from `persons` where `user_id` = 48
delete from `users` where `id` = 48
delete from `model_has_roles` where `model_id` = '48'
---
    public function destroy($id)
    {
        $user = User::findOrFail($id);
        $persons = User::where('id',$id)->get();
        foreach ($persons as $person){
            DB::table('persons')->where('user_id',$person->id)->delete();
        }
        User::where('id',$user->id)->delete();
        DB::table('model_has_roles')->where('model_id', $id)->delete();

select `slug`, `email`, `id` from `persons`
---
    public function storeLogin(Request $request)
    {
        $data = $request->only('email', 'password');
        if (Auth::attempt($data)) {
            if (auth()->user()->admin == 1) {
                return redirect()->to('en/person')->with('success', 'Login success');
            } else {
                $persons = DB::table('persons')->select(['slug', 'email', 'id'])->get();